chore: use mermaid for diagrams
